Autodesk.AutoCAD.BoundaryRepresentation.LoopVertexCollection
This class represents a collection of vertices corresponding to the loop.

Autodesk.AutoCAD.BoundaryRepresentation.LoopVertexCollection.GetEnumerator
Returns an enumeration of this collection.