Autodesk.AutoCAD.BoundaryRepresentation.BrepVertexEnumerator
This class represents an enumeration of vertices corresponding to the Brep.

Autodesk.AutoCAD.BoundaryRepresentation.BrepVertexEnumerator.Current
Accesses the current item in the enumeration.