Autodesk.AutoCAD.BoundaryRepresentation.BrepFaceEnumerator
This class represents an enumeration of faces corresponding to the Brep.

Autodesk.AutoCAD.BoundaryRepresentation.BrepFaceEnumerator.Current
Accesses the current item in the enumeration.