Autodesk.AutoCAD.BoundaryRepresentation.Exception
This class provides a container for BREP errors.

Autodesk.AutoCAD.BoundaryRepresentation.Exception.#ctor(Autodesk.AutoCAD.BoundaryRepresentation.ErrorStatus,System.String)
This constructor sets an error status to be thrown, with an error message.
es:  Input error status
message:  Input error message

Autodesk.AutoCAD.BoundaryRepresentation.Exception.#ctor(Autodesk.AutoCAD.BoundaryRepresentation.ErrorStatus)
This constructor sets an error status to be thrown.
es:  Input error status

Autodesk.AutoCAD.BoundaryRepresentation.Exception.#ctor
Default constructor.

Autodesk.AutoCAD.BoundaryRepresentation.Exception.ErrorStatus
Returns the ErrorStatus property value.