Autodesk.AutoCAD.BoundaryRepresentation.VertexLoopEnumerator
This class represents an enumeration of loops corresponding to the vertex.

Autodesk.AutoCAD.BoundaryRepresentation.VertexLoopEnumerator.Current
Accesses the current item in the enumeration.