Autodesk.AutoCAD.BoundaryRepresentation.ComplexShellEnumerator
This class represents an enumeration of shells corresponding to the complex.

Autodesk.AutoCAD.BoundaryRepresentation.ComplexShellEnumerator.Current
Accesses the current item in the enumeration.