Autodesk.AutoCAD.BoundaryRepresentation.Shell
This .NET class wraps the AcBrShell ObjectARX class.

Autodesk.AutoCAD.BoundaryRepresentation.Shell.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Constructs a shell from the given path.
fullPath:  Input path to construct a shell from

Autodesk.AutoCAD.BoundaryRepresentation.Shell.Faces
Accesses all the faces associated with this object.

Autodesk.AutoCAD.BoundaryRepresentation.Shell.Complex
Accesses the complex associated with this object.

Autodesk.AutoCAD.BoundaryRepresentation.Shell.ShellType
Accesses the shell type associated with this object.