Autodesk.AutoCAD.BoundaryRepresentation.ShellFaceCollection
This class represents a collection of faces corresponding to the shell.

Autodesk.AutoCAD.BoundaryRepresentation.ShellFaceCollection.GetEnumerator
Returns an enumeration of this collection.