Autodesk.AutoCAD.BoundaryRepresentation.MeshEntity
This .NET class wraps the AcBrMeshEntity ObjectARX class.

Autodesk.AutoCAD.BoundaryRepresentation.MeshEntity.Equals(System.Object)
Returns true if the two objects are equal.
obj:  Input object to check against

Autodesk.AutoCAD.BoundaryRepresentation.MeshEntity.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.BoundaryRepresentation.MeshEntity.IsNull
Assesses if this mesh object has been set to anything meaningful.

Autodesk.AutoCAD.BoundaryRepresentation.MeshEntity.ValidationLevel
Accesses the validation level to be used in all data queries that require access to the associated AutoCAD object. In general, this means any function that accesses the brep topology.

Autodesk.AutoCAD.BoundaryRepresentation.MeshEntity.IsBrepChanged
Assesses if the BREP value has changed.

Autodesk.AutoCAD.BoundaryRepresentation.MeshEntity.EntityAssociated
Accesses the dimensionally lowest topology object associated with this mesh object. For a 2d mesh, it returns a face, shell or brep. For a 2d element, it returns a face. For a node, it returns a vertex, edge or face.