Autodesk.AutoCAD.BoundaryRepresentation.LoopEdgeEnumerator
This class represents an enumeration of edges corresponding to the loop.

Autodesk.AutoCAD.BoundaryRepresentation.LoopEdgeEnumerator.Current
Accesses the current item in the enumeration.