Autodesk.AutoCAD.BoundaryRepresentation.BrepShellCollection
This class represents a collection of shells corresponding to the Brep.

Autodesk.AutoCAD.BoundaryRepresentation.BrepShellCollection.GetEnumerator
Returns an enumeration of this collection.