Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity
This .NET class wraps the AcBrEntity ObjectARX class.

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.CheckEntity
Checks the entity's topology, geometry and data structure for errors.

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetLineContainment(Autodesk.AutoCAD.Geometry.LinearEntity3d,System.Int32)
Determines whether a line lies inside or outside the current object's topological boundary. If it lies entirely outside, a null hit array is returned. Similarly, the start or end point of a line segment and the end point of a ray are part of the hit array only when they are contained by the object being tested. The hit array thus defines a segmentation of the subset of the line which is contained. The line may be either a line segment, a ray, or an infinite line, cast to LinearEntity3d. In order for the line and the current topology object to be in the same evaluation space, the entire inverted chain of transforms from the object ID array is applied to the line before testing for line containment.
line:  Input 3D line
numHitsWanted:  Input maximum number of hits to find

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.Equals(System.Object)
Returns true if the two objects are equal.
obj:  Input object to check against

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetMassProperties
Returns the mass properties contributed by this topology object, with an entire chain of transforms from the subentity path applied where appropriate. A uniform unity density is assumed. The tolerance required and tolerance achieved are globalized values.

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetMassProperties(System.Double)
Returns the mass properties contributed by this topology object, with an entire chain of transforms from the subentity path applied where appropriate. The tolerance required and tolerance achieved are globalized values.
density:  Input calculating density

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetMassProperties(System.Double,System.Double)
Returns the mass properties contributed by this topology object, with an entire chain of transforms from the subentity path applied where appropriate. The achieved tolerance is a globalized value.
density:  Input calculating density
tolRequired:  Input tolerance needed for the calculation

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetMassProperties(System.Double,System.Double,System.Double&)
Returns the mass properties contributed by this topology object, with an entire chain of transforms from the subentity path applied where appropriate.
density:  Input calculating density
tolRequired:  Input tolerance needed for the calculation
tolAchieved:  Output tolerance achieved for the calculation

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetVolume
This function returns the volume of this topology object as a double, with the maximum scale factor applied for the nested transforms. The tolerances are assumed to be globalized values.

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetVolume(System.Double)
This function returns the volume of this topology object as a double, with the maximum scale factor applied for the nested transforms. The achieved tolerance is a globalized value.
tolRequired:  Input tolerance requested for the calculation

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetVolume(System.Double,System.Double&)
This function returns the volume of this topology object as a double, with the maximum scale factor applied from the nested transformations.
tolRequired:  Input tolerance requested for the calculation
tolAchieved:  Output tolerance achieved for the calculation

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetSurfaceArea
This function returns the surface area of this topology object as a double, with the maximum scale factor applied from the nested transformations. The tolerances are assumed to be globalized values.

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetSurfaceArea(System.Double)
This function returns the surface area of this topology object as a double, with the maximum scale factor applied from the nested transformations. The achieved tolerance is a globalized value.
tolRequired:  Input tolerance requested for the calculation

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetSurfaceArea(System.Double,System.Double&)
This function returns the surface area of this topology object as a double, with the maximum scale factor applied from the nested transformations.
tolRequired:  Input tolerance requested for the calculation
tolAchieved:  Output tolerance achieved for the calculation

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetPerimeterLength
This function returns the perimeter length of this topology object, with the maximum scale factor applied from the nested transformations. The tolerances are assumed to be globalized values.

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetPerimeterLength(System.Double)
This function returns the perimeter length of this topology object, with the maximum scale factor applied from the nested transformations. The achieved tolerance is a globalized value.
tolRequired:  Input tolerance requested for the calculation

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.GetPerimeterLength(System.Double,System.Double&)
This function returns the perimeter length of this topology object, with the maximum scale factor applied from the nested transformations.
tolRequired:  Input tolerance requested for the calculation
tolAchieved:  Output tolerance achieved for the calculation

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.IsNull
Assesses if the object is uninitialized or invalidated (that is, empty).

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.SubentityPath
Accesses the full subentity path in AutoCAD for the current object.

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.BoundBlock
Accesses the model space bounding box for the current topology object.

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.Brep
Accesses the brep that is at the top of the current topological hierarchy.

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.ValidationLevel
Accesses the validation level currently being used by this topology object.

Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity.IsBrepChanged
Assesses whether the associated AutoCAD object has changed since this topology object was last set.