Autodesk.AutoCAD.BoundaryRepresentation.BrepComplexCollection
This class represents a collection of complexes corresponding to the Brep.

Autodesk.AutoCAD.BoundaryRepresentation.BrepComplexCollection.GetEnumerator
Returns an enumeration of this collection.