Autodesk.AutoCAD.BoundaryRepresentation.VertexEdgeEnumerator
This class represents an enumeration of edges corresponding to the vertex.

Autodesk.AutoCAD.BoundaryRepresentation.VertexEdgeEnumerator.Current
Accesses the current item in the enumeration.