Autodesk.AutoCAD.BoundaryRepresentation.EdgeLoopCollection
This class represents a collection of loops corresponding to the edge.

Autodesk.AutoCAD.BoundaryRepresentation.EdgeLoopCollection.GetEnumerator
Returns an enumeration of this collection.