Autodesk.AutoCAD.BoundaryRepresentation.MassProperties
This .NET class wraps the AcBrMassProps ObjectARX struct.

Autodesk.AutoCAD.BoundaryRepresentation.MassProperties.Volume
Accesses the volume.

Autodesk.AutoCAD.BoundaryRepresentation.MassProperties.Mass
Accesses the mass value.

Autodesk.AutoCAD.BoundaryRepresentation.MassProperties.Centroid
Accesses the centroid value.

Autodesk.AutoCAD.BoundaryRepresentation.MassProperties.MomentsOfIntertia
Accesses the rigid body's moment vector of inertia.

Autodesk.AutoCAD.BoundaryRepresentation.MassProperties.ProductsOfIntertia
Accesses the vector product of inertia.

Autodesk.AutoCAD.BoundaryRepresentation.MassProperties.PrincipalMoments
Accesses the principal moment vector at the centroid.

Autodesk.AutoCAD.BoundaryRepresentation.MassProperties.RadiiOfGyration
Accesses the radii of gyration.