Autodesk.AutoCAD.BoundaryRepresentation.BrepEdgeEnumerator
This class represents an enumeration of edges corresponding to the Brep.

Autodesk.AutoCAD.BoundaryRepresentation.BrepEdgeEnumerator.Current
Accesses the current item in the enumeration.