Autodesk.AutoCAD.BoundaryRepresentation.EdgeLoopEnumerator
This class represents an enumeration of loops corresponding to the edge.

Autodesk.AutoCAD.BoundaryRepresentation.EdgeLoopEnumerator.Current
Accesses the current item in the enumeration.