Autodesk.AutoCAD.BoundaryRepresentation.BrepFaceCollection
This class represents a collection of faces corresponding to the Brep.

Autodesk.AutoCAD.BoundaryRepresentation.BrepFaceCollection.GetEnumerator
Returns an enumeration of this collection.