Autodesk.AutoCAD.BoundaryRepresentation.ShellFaceEnumerator
This class represents an enumeration of faces corresponding to the shell.

Autodesk.AutoCAD.BoundaryRepresentation.ShellFaceEnumerator.Current
Accesses the current item in the enumeration.