Autodesk.AutoCAD.BoundaryRepresentation.Edge
This .NET class wraps the AcBrEdge ObjectARX class.

Autodesk.AutoCAD.BoundaryRepresentation.Edge.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Constructs an edge from the given path.
fullPath:  Input path to construct an edge from

Autodesk.AutoCAD.BoundaryRepresentation.Edge.GetCurveAsNurb
This function returns the the edge's underlying curve. The tolerances are assumed to be globalized values.

Autodesk.AutoCAD.BoundaryRepresentation.Edge.GetCurveAsNurb(System.Double)
This function returns the the edge's underlying curve. The achieved tolerance is a globalized value.

Autodesk.AutoCAD.BoundaryRepresentation.Edge.GetCurveAsNurb(System.Double,System.Double&)
This function returns the the edge's underlying curve.
Input tolerance requested for the calculation:

Autodesk.AutoCAD.BoundaryRepresentation.Edge.GetLoopsStartingFrom(Autodesk.AutoCAD.BoundaryRepresentation.BoundaryLoop)
Returns a collection of loops starting from a starting point.
startFrom:  Input loop to start collecting from

Autodesk.AutoCAD.BoundaryRepresentation.Edge.Curve
Accesses the curve of the edge object.

Autodesk.AutoCAD.BoundaryRepresentation.Edge.IsOrientToCurve
Assesses if the edge is oriented to a curve.

Autodesk.AutoCAD.BoundaryRepresentation.Edge.Vertex1
Accesses the start vertex of the edge in its natural orientation from vertex1 to vertex2.

Autodesk.AutoCAD.BoundaryRepresentation.Edge.Vertex2
Accesses the end vertex of the edge in its natural orientation from vertex1 to vertex2.

Autodesk.AutoCAD.BoundaryRepresentation.Edge.Loops
Accesses all the loops.