Autodesk.AutoCAD.BoundaryRepresentation.Node
This .NET class wraps the AcBrNode ObjectARX class.

Autodesk.AutoCAD.BoundaryRepresentation.Node.Point
Accesses this node's underlying point as a Point3d object, with the entire chain of transforms from the associated topology object's subentity path applied.