Autodesk.AutoCAD.BoundaryRepresentation.Element2d
This .NET class wraps the AcBrElement2d ObjectARX class.

Autodesk.AutoCAD.BoundaryRepresentation.Element2d.GetNodesStartingFrom(Autodesk.AutoCAD.BoundaryRepresentation.Node)
Returns a collection of nodes starting from a starting point.
startFrom:  Input node to start collecting from

Autodesk.AutoCAD.BoundaryRepresentation.Element2d.Normal
Accesses the normalized model space normal vector computed on the plane defined by the element nodes traversed in a clockwise direction.

Autodesk.AutoCAD.BoundaryRepresentation.Element2d.Nodes
Accesses all the nodes.