Autodesk.AutoCAD.BoundaryRepresentation.Mesh2dControl
This .NET class wraps the AcBrMesh2dControl ObjectARX class.

Autodesk.AutoCAD.BoundaryRepresentation.Mesh2dControl.MaxAspectRatio
Accesses the maximum aspect ratio as a double.

Autodesk.AutoCAD.BoundaryRepresentation.Mesh2dControl.ElementShape
Accesses the element's shape.