Autodesk.AutoCAD.BoundaryRepresentation.LoopEdgeCollection
This class represents a collection of edges corresponding to the loop.

Autodesk.AutoCAD.BoundaryRepresentation.LoopEdgeCollection.GetEnumerator
Returns an enumeration of this collection.