Autodesk.AutoCAD.BoundaryRepresentation.BrepComplexEnumerator
This class represents an enumeration of complexes corresponding to the Brep.

Autodesk.AutoCAD.BoundaryRepresentation.BrepComplexEnumerator.Current
Accesses the current item in the enumeration.