Autodesk.AutoCAD.BoundaryRepresentation.BrepVertexCollection
This class represents a collection of vertices corresponding to the Brep.

Autodesk.AutoCAD.BoundaryRepresentation.BrepVertexCollection.GetEnumerator
Returns an enumeration of this collection.