Autodesk.AutoCAD.BoundaryRepresentation.Mesh2dFilter
This .NET class wraps the AcBrMesh2dFilter ObjectARX class.The Mesh2dFilter class is the interface class for 2d mesh filters. This class defines the mapping between topology objects and 2d mesh controls that are used as filters on 2d mesh generation.

Autodesk.AutoCAD.BoundaryRepresentation.Mesh2dFilter.Insert(Autodesk.AutoCAD.BoundaryRepresentation.BrepEntity,Autodesk.AutoCAD.BoundaryRepresentation.Mesh2dControl)
The Insert() function associates a specific 2d mesh control with a topology object, and adds it to the multimap. For now, only a single entry is supported, and repeated calls will overwrite previous values.
brepEntity:  Input topology to associate with
meshControl:  Input mesh 2d control