Autodesk.AutoCAD.BoundaryRepresentation.Vertex
This .NET class wraps the AcBrVertex ObjectARX class.

Autodesk.AutoCAD.BoundaryRepresentation.Vertex.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Constructs a vertex from the given path.
fullPath:  Input path to construct a vertex from

Autodesk.AutoCAD.BoundaryRepresentation.Vertex.GetLoopsStartingFrom(Autodesk.AutoCAD.BoundaryRepresentation.BoundaryLoop)
Returns a collection of loops starting from a starting point.
startFrom:  Input loop to start collecting from

Autodesk.AutoCAD.BoundaryRepresentation.Vertex.GetEdgesStartingFrom(Autodesk.AutoCAD.BoundaryRepresentation.Edge)
Returns a collection of edges starting from a starting point.
startFrom:  Input edge to start collecting from

Autodesk.AutoCAD.BoundaryRepresentation.Vertex.Point
Accesses this vertex's underlying point as a Point3d object, with the entire chain of transforms from the associated topology object's subentity path applied.

Autodesk.AutoCAD.BoundaryRepresentation.Vertex.Loops
Accesses all the loops associated with this object.

Autodesk.AutoCAD.BoundaryRepresentation.Vertex.Edges
Accesses all the edges associated with this object.