Autodesk.AutoCAD.BoundaryRepresentation.Mesh2d
This .NET class wraps the AcBrMesh2d ObjectARX class.

Autodesk.AutoCAD.BoundaryRepresentation.Mesh2d.#ctor(Autodesk.AutoCAD.BoundaryRepresentation.Mesh2dFilter)
Constructor. Instantiates an object initialized to the same contents as a filter.
meshFilter:  Input a mesh filter

Autodesk.AutoCAD.BoundaryRepresentation.Mesh2d.GetElement2dsStartingFrom(Autodesk.AutoCAD.BoundaryRepresentation.Element2d)
Returns a collection of Mesh2d elements starting from a starting point.
startFrom:  Input element2d to start collecting from

Autodesk.AutoCAD.BoundaryRepresentation.Mesh2d.Element2ds
Accesses all the Mesh2d elements.