Autodesk.AutoCAD.BoundaryRepresentation.Mesh2dElement2dCollection
This class represents a collection of Element2d objects corresponding to the Mesh2d object.

Autodesk.AutoCAD.BoundaryRepresentation.Mesh2dElement2dCollection.GetEnumerator
Returns an enumeration of this collection.