Autodesk.AutoCAD.BoundaryRepresentation.Face
This .NET class wraps the AcBrFace ObjectARX class.

Autodesk.AutoCAD.BoundaryRepresentation.Face.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Constructs a face from the given path.
fullPath:  Input path to construct a face from

Autodesk.AutoCAD.BoundaryRepresentation.Face.GetSurfaceAsTrimmedNurbs
The GetSurfaceAsTrimmedNurbs() model space trimmed surface query converts this face's underlying surface to a trimmed representation. It returns this representation as an ExternalBoundedSurface array, with the entire chain of transforms from the subentity path applied. The surface is converted to a NURB (if necessary) and split along its seams (if crossed by the face boundaries).

Autodesk.AutoCAD.BoundaryRepresentation.Face.GetArea
This function calculates the area of the face. The tolerances are assumed to be globalized values.

Autodesk.AutoCAD.BoundaryRepresentation.Face.GetArea(System.Double)
This function calculates the area of the face. The achieved tolerance is a globalized value.
tolRequired:  Input tolerance requested for the calculation

Autodesk.AutoCAD.BoundaryRepresentation.Face.GetArea(System.Double,System.Double&)
This function calculates the area of the face.
tolRequired:  Input tolerance requested for the calculation
tolAchieved:  Output tolerance achieved for the calculation

Autodesk.AutoCAD.BoundaryRepresentation.Face.GetSurfaceAsNurb
This function returns this face's underlying surface as a subset NurbSurface, with the entire chain of transforms from the subentity path applied. The surface is converted to a NURB (if necessary) using a global fit tolerance (adjusted by the inverse scale factor from the nested transforms, in order to be in the same evaluation space as this face) and is subset to the uv range that results from projecting the face's model space bounding box onto the uv parameter space grid of the surface. The achieved tolerance is a globalized value.

Autodesk.AutoCAD.BoundaryRepresentation.Face.GetSurfaceAsNurb(System.Double)
This function returns this face's underlying surface as a subset NurbSurface, with the entire chain of transforms from the subentity path applied. The surface is converted to a NURB (if necessary) using the supplied fit tolerance (adjusted by the inverse scale factor from the nested transforms, in order to be in the same evaluation space as this face) and is subset to the uv range that results from projecting the face's model space bounding box onto the uv parameter space grid of the surface. The achieved tolerance is a globalized value.

Autodesk.AutoCAD.BoundaryRepresentation.Face.GetSurfaceAsNurb(System.Double,System.Double&)
This function returns this face's underlying surface as a subset NurbSurface, with the entire chain of transforms from the subentity path applied. The surface is converted to a NURB (if necessary) using the supplied fit tolerance (adjusted by the inverse scale factor from the nested transforms, in order to be in the same evaluation space as this face) and is subset to the uv range that results from projecting the face's model space bounding box onto the uv parameter space grid of the surface. The achieved fit tolerance (if supplied) is returned as a double, with the maximum scale factor applied from the nested transforms.
Input tolerance requested for the calculation:

Autodesk.AutoCAD.BoundaryRepresentation.Face.GetLoopsStartingFrom(Autodesk.AutoCAD.BoundaryRepresentation.BoundaryLoop)
Returns a collection of loops starting from a starting point.
startFrom:  Input loop to start collecting from

Autodesk.AutoCAD.BoundaryRepresentation.Face.Shell
Accesses the shell associated with this object.

Autodesk.AutoCAD.BoundaryRepresentation.Face.Surface
Accesses the surface associated with this object.

Autodesk.AutoCAD.BoundaryRepresentation.Face.IsOrientToSurface
Assesses if the outside of the face is in the direction of the surface normal.

Autodesk.AutoCAD.BoundaryRepresentation.Face.Loops
Accesses all the loops associated with this object.