Autodesk.AutoCAD.BoundaryRepresentation.MeshControl
This .NET class wraps the AcBrMeshControl ObjectARX class.

Autodesk.AutoCAD.BoundaryRepresentation.MeshControl.Equals(System.Object)
Returns true if the two objects are equal.
obj:  Input object to check against

Autodesk.AutoCAD.BoundaryRepresentation.MeshControl.GetHashCode
Returns the hash code for this object.

Autodesk.AutoCAD.BoundaryRepresentation.MeshControl.MaxSubdivisions
Accesses the maximum number of subdivisions as an unsigned 32-bit integer.

Autodesk.AutoCAD.BoundaryRepresentation.MeshControl.MaxNodeSpacing
Accesses the maximum node spacing as a double.

Autodesk.AutoCAD.BoundaryRepresentation.MeshControl.AngleTolerance
Accesses the maximum angle tolerance as a double.

Autodesk.AutoCAD.BoundaryRepresentation.MeshControl.DistanceTolerance
Accesses the maximum distance tolerance as a double.