Autodesk.AutoCAD.BoundaryRepresentation.ComplexShellCollection
This class represents a collection of shells corresponding to the complex.

Autodesk.AutoCAD.BoundaryRepresentation.ComplexShellCollection.GetEnumerator
Returns an enumeration of this collection.