Autodesk.AutoCAD.BoundaryRepresentation.Complex
This .NET class wraps the AcBrComplex ObjectARX class.

Autodesk.AutoCAD.BoundaryRepresentation.Complex.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Constructs a complex from the given path.
fullPath:  Input path to construct a complex from

Autodesk.AutoCAD.BoundaryRepresentation.Complex.GetShellsStartingFrom(Autodesk.AutoCAD.BoundaryRepresentation.Shell)
Returns a collection of shells starting from a starting point.
startFrom:  Input the shell to start collecting from

Autodesk.AutoCAD.BoundaryRepresentation.Complex.Shells
Accesses all the shells.