Autodesk.AutoCAD.BoundaryRepresentation.EnumeratorBase
This .NET class wraps the AcBrTraverser ObjectARX class.

Autodesk.AutoCAD.BoundaryRepresentation.EnumeratorBase.MoveNext
This method advances one item forward.

Autodesk.AutoCAD.BoundaryRepresentation.EnumeratorBase.Reset
This method resets the enumeration to point to the beginning.

Autodesk.AutoCAD.BoundaryRepresentation.EnumeratorBase.IsNull
Assesses if the object is uninitialized or invalidated (that is, empty).

Autodesk.AutoCAD.BoundaryRepresentation.EnumeratorBase.ValidationLevel
Accesses the validation level to be used in all data queries that require access to the associated AutoCAD object. In general, this means any function that accesses the brep topology.

Autodesk.AutoCAD.BoundaryRepresentation.EnumeratorBase.BrepChanged
Assesses whether the associated AutoCAD object has changed since this topology object was last set.