Autodesk.AutoCAD.BoundaryRepresentation.Mesh2dElement2dEnumerator
This class represents an enumeration of Element2d objects corresponding to the Mesh2d object.

Autodesk.AutoCAD.BoundaryRepresentation.Mesh2dElement2dEnumerator.Current
Accesses the current item in the enumeration.