Autodesk.AutoCAD.BoundaryRepresentation.FaceLoopCollection
This class represents a collection of loops corresponding to the face.

Autodesk.AutoCAD.BoundaryRepresentation.FaceLoopCollection.GetEnumerator
Returns an enumeration of this collection.