Autodesk.AutoCAD.BoundaryRepresentation.VertexEdgeCollection
This class represents a collection of edges corresponding to the vertex.

Autodesk.AutoCAD.BoundaryRepresentation.VertexEdgeCollection.GetEnumerator
Returns an enumeration of this collection.