Autodesk.AutoCAD.BoundaryRepresentation.FaceLoopEnumerator
This class represents an enumeration of loops corresponding to the face.

Autodesk.AutoCAD.BoundaryRepresentation.FaceLoopEnumerator.Current
Accesses the current item in the enumeration.