Autodesk.AutoCAD.BoundaryRepresentation.BoundaryLoop
This class wraps the AcBrLoop ObjectARX class.

Autodesk.AutoCAD.BoundaryRepresentation.BoundaryLoop.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Constructs a boundary loop from the given path.
fullPath:  Input path to construct loop from

Autodesk.AutoCAD.BoundaryRepresentation.BoundaryLoop.GetEdgesStartingFrom(Autodesk.AutoCAD.BoundaryRepresentation.Edge)
Returns a collection of the edges from a starting point.
startFrom:  Input edge to start collecting from

Autodesk.AutoCAD.BoundaryRepresentation.BoundaryLoop.Face
Accesses the face associated with this object.

Autodesk.AutoCAD.BoundaryRepresentation.BoundaryLoop.LoopType
Accesses the type of loop associated with this object.

Autodesk.AutoCAD.BoundaryRepresentation.BoundaryLoop.Edges
Accesses all the edges associated with this object.

Autodesk.AutoCAD.BoundaryRepresentation.BoundaryLoop.Vertices
Accesses all the vertices associated with this object.