Autodesk.AutoCAD.BoundaryRepresentation.VertexLoopCollection
This class represents a collection of loops corresponding to the vertex.

Autodesk.AutoCAD.BoundaryRepresentation.VertexLoopCollection.GetEnumerator
Returns an enumeration of this collection.