Autodesk.AutoCAD.BoundaryRepresentation.Element2dNodeEnumerator
This class represents an enumeration of nodes corresponding to an Element2d object.

Autodesk.AutoCAD.BoundaryRepresentation.Element2dNodeEnumerator.Current
Accesses the current item in the enumeration.