Autodesk.AutoCAD.BoundaryRepresentation.Brep
This .NET class wraps the AcBrBrep ObjectARX class.

Autodesk.AutoCAD.BoundaryRepresentation.Brep.#ctor(Autodesk.AutoCAD.DatabaseServices.FullSubentityPath)
Constructs a brep from the given path.
fullPath:  Input path to construct brep from

Autodesk.AutoCAD.BoundaryRepresentation.Brep.#ctor(Autodesk.AutoCAD.DatabaseServices.Entity)
Creates a brep object from another entity.
entity:  Input entity

Autodesk.AutoCAD.BoundaryRepresentation.Brep.GetShellsStartingFrom(Autodesk.AutoCAD.BoundaryRepresentation.Shell)
Returns a collection of shells starting from a starting point.
startFrom:  Input shell to start collecting from

Autodesk.AutoCAD.BoundaryRepresentation.Brep.GetComplexsStartingFrom(Autodesk.AutoCAD.BoundaryRepresentation.Complex)
Returns a collection of complexes starting from a starting point.
startFrom:  Input complex to start collecting from

Autodesk.AutoCAD.BoundaryRepresentation.Brep.GetEdgesStartingFrom(Autodesk.AutoCAD.BoundaryRepresentation.Edge)
Returns a collection of edges starting from a starting point.
startFrom:  Input edge to start collecting from

Autodesk.AutoCAD.BoundaryRepresentation.Brep.Solid
Accesses the solid associated with this object.

Autodesk.AutoCAD.BoundaryRepresentation.Brep.Shells
Accesses all the shells associated with this object.

Autodesk.AutoCAD.BoundaryRepresentation.Brep.Faces
Accesses all the faces associated with this object.

Autodesk.AutoCAD.BoundaryRepresentation.Brep.Complexes
Accesses all the complexes associated with this object.

Autodesk.AutoCAD.BoundaryRepresentation.Brep.Edges
Accesses all the edges associated with this object.

Autodesk.AutoCAD.BoundaryRepresentation.Brep.Vertices
Accesses all the vertices associated with this object.