Autodesk.AutoCAD.BoundaryRepresentation.Element2dNodeCollection
This class represents a collection of nodes corresponding to an Element2d object.

Autodesk.AutoCAD.BoundaryRepresentation.Element2dNodeCollection.GetEnumerator
Returns an enumeration of this collection.