Autodesk.AutoCAD.BoundaryRepresentation.Hit
This .NET class wraps the AcBrHit ObjectARX class.

Autodesk.AutoCAD.BoundaryRepresentation.Hit.Equals(System.Object)
Returns true if the two objects are equal.
obj:  Input object to check against

Autodesk.AutoCAD.BoundaryRepresentation.Hit.GetHashCode
Returns the hash code for this object. See the Microsoft .NET API documentation for details.

Autodesk.AutoCAD.BoundaryRepresentation.Hit.IsNull
Assesses if this object is null.

Autodesk.AutoCAD.BoundaryRepresentation.Hit.Point
Accesses the point for the hit object.

Autodesk.AutoCAD.BoundaryRepresentation.Hit.EntityHit
Accesses the dimensionally lowest topological entity that contains this hit. Note that the start and end points of lines are classified as hits so long as they pass a point containment test. It is not necessary for the ray they define to pass through a geometric boundary; a hit may reside in the interior of a solid.

Autodesk.AutoCAD.BoundaryRepresentation.Hit.EntityEntered
Accesses the dimensionally lowest topological entity that contains the segment along the original line bound by this hit and the next hit, or NULL if this is either the final hit in the hit array or the segment exits and then re-enters the object being tested.

Autodesk.AutoCAD.BoundaryRepresentation.Hit.EntityAssociated
Accesses the topology object whose line containment test generated this hit object.

Autodesk.AutoCAD.BoundaryRepresentation.Hit.ValidationLevel
Accesses the validation level to be used in all data queries that require access to the associated AutoCAD object. In general, this means any function that accesses the brep topology.

Autodesk.AutoCAD.BoundaryRepresentation.Hit.IsBrepChanged
Assesses whether the associated AutoCAD object has changed since this topology object was last set.