Autodesk.AutoCAD.BoundaryRepresentation.LoopVertexEnumerator
This class represents an enumeration of vertices corresponding to the loop.

Autodesk.AutoCAD.BoundaryRepresentation.LoopVertexEnumerator.Current
Accesses the current item in the enumeration.