Autodesk.AutoCAD.BoundaryRepresentation.BrepEdgeCollection
This class represents a collection of edges corresponding to the Brep.

Autodesk.AutoCAD.BoundaryRepresentation.BrepEdgeCollection.GetEnumerator
Returns an enumeration of this collection.