Autodesk.AutoCAD.BoundaryRepresentation.BrepShellEnumerator
This class represents an enumeration of shells corresponding to the Brep.

Autodesk.AutoCAD.BoundaryRepresentation.BrepShellEnumerator.Current
Accesses the current item in the enumeration.